Revit 2024 API
UIMacroManager.RemoveModule Method
 Removes a MacroModule from the application or document.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void RemoveModule(
	MacroModule module
)
Visual Basic
Public Sub RemoveModule ( _
	module As MacroModule _
)
Visual C++
public:
void RemoveModule(
	MacroModule^ module
)
Parameters
module
Type: Autodesk.Revit.DB.Macros.MacroModule
 The module will be removed.
Remarks
 Note: document-level modules will not be removed to the document until the document is saved. Thus this operation is not undoable and does not require an open transaction even for document-level modules.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace